report/statistics.json
{
  "http://localhost:1080/cgi-bin/welcome.pl?signOff=true" : {
    "transaction" : "http://localhost:1080/cgi-bin/welcome.pl?signOff=true",
    "sampleCount" : 1091,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 616.5389550870761,
    "medianResTime" : 611.0,
    "minResTime" : 62.0,
    "maxResTime" : 1505.0,
    "pct1ResTime" : 939.0,
    "pct2ResTime" : 1010.3999999999999,
    "pct3ResTime" : 1220.3199999999997,
    "throughput" : 5.196945663098828,
    "receivedKBytesPerSec" : 5.2020208053479475,
    "sentKBytesPerSec" : 2.669524823037093
  },
  "http://localhost:1080/webtours/header.html" : {
    "transaction" : "http://localhost:1080/webtours/header.html",
    "sampleCount" : 1091,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1448212648945941,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 171.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 22.079999999999927,
    "throughput" : 5.203514160617362,
    "receivedKBytesPerSec" : 5.117127695060239,
    "sentKBytesPerSec" : 2.617001750701115
  },
  "http://localhost:1080/cgi-bin/nav.pl?page=menu&in=flights" : {
    "transaction" : "http://localhost:1080/cgi-bin/nav.pl?page=menu&in=flights",
    "sampleCount" : 1067,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 692.9925023430183,
    "medianResTime" : 713.0,
    "minResTime" : 165.0,
    "maxResTime" : 1562.0,
    "pct1ResTime" : 1017.0,
    "pct2ResTime" : 1098.1999999999998,
    "pct3ResTime" : 1290.2799999999997,
    "throughput" : 5.123034449645901,
    "receivedKBytesPerSec" : 8.750182863701836,
    "sentKBytesPerSec" : 2.791653537990637
  },
  "http://localhost:1080/cgi-bin/reservations.pl?page=welcome" : {
    "transaction" : "http://localhost:1080/cgi-bin/reservations.pl?page=welcome",
    "sampleCount" : 1065,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 779.5906103286386,
    "medianResTime" : 802.0,
    "minResTime" : 205.0,
    "maxResTime" : 1545.0,
    "pct1ResTime" : 1084.4,
    "pct2ResTime" : 1179.7999999999997,
    "pct3ResTime" : 1340.0599999999993,
    "throughput" : 5.119158631430192,
    "receivedKBytesPerSec" : 22.596257982162257,
    "sentKBytesPerSec" : 2.7945406982123804
  },
  "http://localhost:1080/cgi-bin/login.pl?intro=true" : {
    "transaction" : "http://localhost:1080/cgi-bin/login.pl?intro=true",
    "sampleCount" : 2106,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 736.2374169040833,
    "medianResTime" : 757.0,
    "minResTime" : 195.0,
    "maxResTime" : 1691.0,
    "pct1ResTime" : 1056.0,
    "pct2ResTime" : 1132.2999999999997,
    "pct3ResTime" : 1294.2999999999984,
    "throughput" : 10.084081898450519,
    "receivedKBytesPerSec" : 11.364287608214743,
    "sentKBytesPerSec" : 5.416254925925571
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 18207,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 692.3821607074187,
    "medianResTime" : 663.0,
    "minResTime" : 0.0,
    "maxResTime" : 8794.0,
    "pct1ResTime" : 1051.0,
    "pct2ResTime" : 1173.0,
    "pct3ResTime" : 4371.359999999986,
    "throughput" : 86.64471242159765,
    "receivedKBytesPerSec" : 145.12301339561898,
    "sentKBytesPerSec" : 51.1721742881923
  },
  "http://localhost:1080/cgi-bin/welcome.pl?page=search" : {
    "transaction" : "http://localhost:1080/cgi-bin/welcome.pl?page=search",
    "sampleCount" : 1069,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 689.4677268475211,
    "medianResTime" : 705.0,
    "minResTime" : 157.0,
    "maxResTime" : 1598.0,
    "pct1ResTime" : 1013.0,
    "pct2ResTime" : 1089.0,
    "pct3ResTime" : 1273.3,
    "throughput" : 5.126999961631432,
    "receivedKBytesPerSec" : 4.220762663725876,
    "sentKBytesPerSec" : 2.7687802527169745
  },
  "http://localhost:1080/cgi-bin/reservations.pl" : {
    "transaction" : "http://localhost:1080/cgi-bin/reservations.pl",
    "sampleCount" : 3171,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 774.1835383159888,
    "medianResTime" : 803.0,
    "minResTime" : 193.0,
    "maxResTime" : 1883.0,
    "pct1ResTime" : 1088.0,
    "pct2ResTime" : 1166.0,
    "pct3ResTime" : 1348.119999999999,
    "throughput" : 15.275964563230739,
    "receivedKBytesPerSec" : 41.66182417947693,
    "sentKBytesPerSec" : 12.429861716631098
  },
  "http://localhost:1080/cgi-bin/welcome.pl?page=menus" : {
    "transaction" : "http://localhost:1080/cgi-bin/welcome.pl?page=menus",
    "sampleCount" : 1048,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 701.8187022900764,
    "medianResTime" : 709.0,
    "minResTime" : 152.0,
    "maxResTime" : 1650.0,
    "pct1ResTime" : 1024.0,
    "pct2ResTime" : 1108.55,
    "pct3ResTime" : 1303.04,
    "throughput" : 5.074790204880127,
    "receivedKBytesPerSec" : 4.078664393180024,
    "sentKBytesPerSec" : 2.7356290948181936
  },
  "http://localhost:1080/WebTours/home.html" : {
    "transaction" : "http://localhost:1080/WebTours/home.html",
    "sampleCount" : 1081,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.25809435707674,
    "medianResTime" : 57.0,
    "minResTime" : 0.0,
    "maxResTime" : 219.0,
    "pct1ResTime" : 65.0,
    "pct2ResTime" : 72.0,
    "pct3ResTime" : 171.18000000000006,
    "throughput" : 5.171877616439012,
    "receivedKBytesPerSec" : 8.379047818039377,
    "sentKBytesPerSec" : 2.732407998528814
  },
  "http://localhost:1080/webtours/" : {
    "transaction" : "http://localhost:1080/webtours/",
    "sampleCount" : 1128,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1653.3031914893613,
    "medianResTime" : 102.0,
    "minResTime" : 1.0,
    "maxResTime" : 8794.0,
    "pct1ResTime" : 5552.8,
    "pct2ResTime" : 6748.249999999997,
    "pct3ResTime" : 8062.97,
    "throughput" : 5.372196028004001,
    "receivedKBytesPerSec" : 3.483533361908844,
    "sentKBytesPerSec" : 2.644127732533219
  },
  "http://localhost:1080/cgi-bin/nav.pl?in=home" : {
    "transaction" : "http://localhost:1080/cgi-bin/nav.pl?in=home",
    "sampleCount" : 1089,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 681.1322314049589,
    "medianResTime" : 683.0,
    "minResTime" : 176.0,
    "maxResTime" : 1414.0,
    "pct1ResTime" : 1002.0,
    "pct2ResTime" : 1089.5,
    "pct3ResTime" : 1288.2999999999988,
    "throughput" : 5.196924794914745,
    "receivedKBytesPerSec" : 8.904634536046807,
    "sentKBytesPerSec" : 2.765941419168492
  },
  "http://localhost:1080/cgi-bin/login.pl" : {
    "transaction" : "http://localhost:1080/cgi-bin/login.pl",
    "sampleCount" : 1080,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 673.7064814814819,
    "medianResTime" : 692.0,
    "minResTime" : 98.0,
    "maxResTime" : 1468.0,
    "pct1ResTime" : 992.9,
    "pct2ResTime" : 1076.8500000000001,
    "pct3ResTime" : 1237.4700000000007,
    "throughput" : 5.162129091465279,
    "receivedKBytesPerSec" : 5.2175816500650045,
    "sentKBytesPerSec" : 3.6901157177271333
  },
  "http://localhost:1080/cgi-bin/nav.pl?page=menu&in=home" : {
    "transaction" : "http://localhost:1080/cgi-bin/nav.pl?page=menu&in=home",
    "sampleCount" : 2121,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 700.7463460631776,
    "medianResTime" : 717.0,
    "minResTime" : 157.0,
    "maxResTime" : 1526.0,
    "pct1ResTime" : 1014.0,
    "pct2ResTime" : 1098.0,
    "pct3ResTime" : 1291.0,
    "throughput" : 10.140610731548726,
    "receivedKBytesPerSec" : 17.320242353006567,
    "sentKBytesPerSec" : 5.49613179297807
  }
}